; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph3 - mode
	infrared0 - mode
	thermograph1 - mode
	infrared4 - mode
	infrared2 - mode
	Star2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 infrared4)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared0)
	(supports instrument5 infrared4)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument8 infrared4)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star1)
	(supports instrument10 infrared2)
	(supports instrument10 infrared4)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
)
(:goal (and
	(pointing satellite2 Star8)
	(pointing satellite4 Star11)
	(have_image Star8 infrared2)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 infrared4)
	(have_image Star12 thermograph1)
	(have_image Phenomenon13 thermograph3)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 infrared0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
4. (turn_to satellite4 groundstation4 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 groundstation4)
   goals met: 0 of 10
5. (calibrate satellite4 instrument10 groundstation4)
   added: (calibrated instrument10)
   goals met: 0 of 10
6. (turn_to satellite4 phenomenon10 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 10
7. (take_image satellite4 phenomenon10 instrument10 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 1 of 10
8. (turn_to satellite4 star11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star11)
   goals met: 2 of 10
9. (take_image satellite4 star11 instrument10 infrared4)
   added: (have_image star11 infrared4)
   goals met: 3 of 10
10. (turn_to satellite2 star1 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star1)
   goals met: 3 of 10
11. (calibrate satellite2 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 3 of 10
12. (turn_to satellite2 phenomenon14 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 10
13. (take_image satellite2 phenomenon14 instrument5 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 4 of 10
14. (turn_to satellite2 planet15 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet15)
   goals met: 4 of 10
15. (take_image satellite2 planet15 instrument5 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 5 of 10
16. (turn_to satellite2 star8 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 star8)
   goals met: 6 of 10
17. (take_image satellite2 star8 instrument5 infrared2)
   added: (have_image star8 infrared2)
   goals met: 7 of 10
18. (turn_to satellite0 groundstation4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation4)
   goals met: 7 of 10
19. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 7 of 10
20. (turn_to satellite0 phenomenon13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 10
21. (take_image satellite0 phenomenon13 instrument0 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 8 of 10
22. (turn_to satellite4 star12 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star12)
   goals met: 7 of 10
23. (take_image satellite4 star12 instrument10 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 8 of 10
24. (turn_to satellite4 star11 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star11)
   goals met: 9 of 10
25. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 8 of 10
26. (take_image satellite2 star9 instrument5 infrared0)
   added: (have_image star9 infrared0)
   goals met: 9 of 10
27. (turn_to satellite2 star8 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star8)
   goals met: 10 of 10
